app/controllers/users_controller.rb

INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login_count", "name", "password_salt", "perishable_token", "persistence_token", "role_name", "single_access_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
SELECT "users".* FROM "users" WHERE (LOWER("users".email) = 'nicole@highlinesale.com') LIMIT 1
---
  def create
    @user = User.new(params[:user])
    @active_link = "new_account"
    if @user.save
        @user_session = UserSession.new(:email=>params[:user][:email], :password=>params[:user][:password])
        @user_session.save #i.e. log them in
        TempSession.new(request.session_options).copy_to(@user) #copy the post over

        reset_session #clear the shopping cart or the items might get added again later
        redirect_to root_url
    else

        flash[:error] = "-- " + @user.errors.full_messages.join('<br/> -- ')

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
---
  def index
    @users = User.paginate({:page=>1})